/* REXX */
ADDRESS TSO
PARSE ARG MEMBER
DSNAME = 'IBMUSER.EMPMAINT.CICS('||MEMBER||')'
QUOTE = "'"
DSNAMEQUOTED = QUOTE||DSNAME||QUOTE


JUMP_HERE:
SAY
SAY DSNAMEQUOTED
ADDRESS TSO "ALLOCATE DA('"DSNAME"') F(MYDD) SHR"
ALLOC_RC = RC

IF ALLOC_RC = 0 THEN DO
SAY 'DATASET ALLOCATED TO TSO SUCCESSFULLY. PROCEEDING WITH PROCESSING.'
  ADDRESS TSO "FREE F(MYDD)"
  FIRSTTHREE = SUBSTR(MEMBER, 1, 3)
  IF FIRSTTHREE = 'COB' THEN DO
     DO COUNT = 1 TO 300000
     END
  END
  "SUBMIT" DSNAMEQUOTED
END
ELSE DO
  SAY 'FAILED TO ALLOCATE DATASET. RC = ' ALLOC_RC
  SAY 'WAITING FOR ENQUEUE LOCK ON PDS TO BE REMOVED...'
  DO COUNT = 1 TO 200000
  END
  SIGNAL JUMP_HERE
END

EXIT

